<!--Выведите 10 раз фразу "You are welcome!"<br/>-->
<!--<br/>-->
<?php
//$i = 1;
//while ($i<=10){
//    echo "You are welcome!<br/>";
//    $i++;
//}
//?>

<!--Выведите на экран n раз фразу "Silence is golden".<br/>-->
<!--Число n вводит пользователь на форме.<br/>-->
<!--Если n некорректно, вывести фразу "Bad n".<br/>-->
<!--<br/>-->
<!---->
<!--<form method="post">-->
<!--    <input type="text" name="number">-->
<!--    <input type="submit" value="Отправить">-->
<!--</form>-->
<!---->
<?php
//if (empty($_POST['number'])){
//    echo "данне не введены";
//}else{
//    $n = $_POST['number'];
//    if (is_numeric($_POST['number'])){
//        $i = 1;
//        while ($i<=$n){
//            echo "You are welcome!<br/>";
//            $i++;
//        }
//    }else {
//        echo "Bad ".$n;
//    }
//}
//?>

<!--Найти сумму 1+4+7+10+...+112. Ответ: 2147<br/>-->
<!--<br/>-->
<!---->
<?php
//$a = 1+4+7+10;
//$b = 112;
//$d = 2147;
//$c = $a +$b;
//$z = $d - $c;
//echo "1+4+7+10= $a + $b = $d - $c = $z<br/>";
//echo "Ответ 1+4+7+10+.$z.+112=$d";
//?>

Решите числовой ребус ЛИСА + ВОЛК = ЗВЕРИ.<br/>
Каждая буква соответствует своей цифре,<br/>
причем различным буквам соответствуют различные цифры.<br/>
<br/>
<?php
$arr = ['а'=>1,'б'=>2,'в'=>3,'г'=>4,'д'=>5,'е'=>6,'ё'=>7,'ж'=>8,'з'=>9,'и'=>10,'й'=>11,'к'=>12,'л'=>13,
'м'=>14,'н'=>15,'о'=>16,'п'=>17,'р'=>18,'с'=>19,'т'=>20,'у'=>21,'ф'=>22,'х'=>23,'ц'=>24,'ч'=>25,
'ш'=>26,'щ'=>27,'ъ'=>28,'ы'=>29,'ь'=>30,'э'=>31,'ю'=>32,'я'=>33];
?>
